#!/usr/bin/env python3
# -*- coding: utf-8 -*-

if __name__ == "__main__":

    # исправление ошибки в слове прроцесор
    s = "прроцесор"
    s = s[:2] + s[3:6] + "c" + s[6:]
    print(s)

    # исправление ошибки во фразе теекстовыйфайл
    s = "теекстовыйфайл"
    s = s[:2] + s[3:10] + " " + s[10:]
    print(s)

    # исправление ошибки во фразе програма и аллгоритм
    s = "програма и аллгоритм"
    s = s[:6] + "мм" + s[7:13] + s[14:]
    print(s)

    # исправление ошибки во фразе процесор и паммять
    s = "процесор и паммять"
    s = s[:5] + "c" + s[5:8] + s[8:14] + s[15:]
    print(s)
    input("Нажмите на любую кнопку, чтобы выйти!")
